{
  "activation": "gelu",
  "architectures": [
    "DistilBertForTokenClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "B-ATTACK-PATTERN",
    "1": "I-ATTACK-PATTERN",
    "2": "B-CAMPAIGN",
    "3": "I-CAMPAIGN",
    "4": "B-DOMAIN",
    "5": "I-DOMAIN",
    "6": "B-EMAIL",
    "7": "I-EMAIL",
    "8": "B-FILEPATH",
    "9": "I-FILEPATH",
    "10": "B-IDENTITY",
    "11": "I-IDENTITY",
    "12": "B-INFRASTUCTURE",
    "13": "I-INFRASTUCTURE",
    "14": "B-IPV4",
    "15": "I-IPV4",
    "16": "B-LOCATION",
    "17": "I-LOCATION",
    "18": "B-MALWARE",
    "19": "I-MALWARE",
    "20": "B-MD5",
    "21": "I-MD5",
    "22": "B-REGISTRYKEY",
    "23": "I-REGISTRYKEY",
    "24": "B-SHA1",
    "25": "I-SHA1",
    "26": "B-SHA2",
    "27": "I-SHA2",
    "28": "B-SOFTWARE",
    "29": "I-SOFTWARE",
    "30": "B-THREAT-ACTOR",
    "31": "I-THREAT-ACTOR",
    "32": "B-TIME",
    "33": "I-TIME",
    "34": "B-TOOLS",
    "35": "I-TOOLS",
    "36": "B-URL",
    "37": "I-URL",
    "38": "B-VULNERABILITY",
    "39": "I-VULNERABILITY",
    "40": "O"
  },
  "initializer_range": 0.02,
  "label2id": {
    "B-ATTACK-PATTERN": 0,
    "B-CAMPAIGN": 2,
    "B-DOMAIN": 4,
    "B-EMAIL": 6,
    "B-FILEPATH": 8,
    "B-IDENTITY": 10,
    "B-INFRASTUCTURE": 12,
    "B-IPV4": 14,
    "B-LOCATION": 16,
    "B-MALWARE": 18,
    "B-MD5": 20,
    "B-REGISTRYKEY": 22,
    "B-SHA1": 24,
    "B-SHA2": 26,
    "B-SOFTWARE": 28,
    "B-THREAT-ACTOR": 30,
    "B-TIME": 32,
    "B-TOOLS": 34,
    "B-URL": 36,
    "B-VULNERABILITY": 38,
    "I-ATTACK-PATTERN": 1,
    "I-CAMPAIGN": 3,
    "I-DOMAIN": 5,
    "I-EMAIL": 7,
    "I-FILEPATH": 9,
    "I-IDENTITY": 11,
    "I-INFRASTUCTURE": 13,
    "I-IPV4": 15,
    "I-LOCATION": 17,
    "I-MALWARE": 19,
    "I-MD5": 21,
    "I-REGISTRYKEY": 23,
    "I-SHA1": 25,
    "I-SHA2": 27,
    "I-SOFTWARE": 29,
    "I-THREAT-ACTOR": 31,
    "I-TIME": 33,
    "I-TOOLS": 35,
    "I-URL": 37,
    "I-VULNERABILITY": 39,
    "O": 40
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.0.0",
  "use_cache": false,
  "vocab_size": 30522
}
